; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v5 ?v1)
		(pred_2 ?v8)
		(pred_4 ?v6)
		(pred_3 ?v6)
		(pred_5 ?v8 ?v6)
		(pred_1)
		(pred_6 ?v8))

   (:action op_2
       :parameters  (?v7 ?v4)
       :precondition (and (not-eq ?v7 ?v4) 
                          (pred_4 ?v7) (pred_4 ?v4) (pred_3 ?v7))
       :effect (and  (pred_3 ?v4)
		     (not (pred_3 ?v7))))


   (:action op_1
       :parameters (?v2 ?v3)
       :precondition  (and  (pred_2 ?v2) (pred_4 ?v3)
			    (pred_5 ?v2 ?v3) (pred_3 ?v3) (pred_1))
       :effect (and (pred_6 ?v2)
		    (not (pred_5 ?v2 ?v3)) 
		    (not (pred_1))))

   (:action op_3
       :parameters  (?v2  ?v3)
       :precondition  (and  (pred_2 ?v2) (pred_4 ?v3)
			    (pred_6 ?v2) (pred_3 ?v3))
       :effect (and (pred_5 ?v2 ?v3)
		    (pred_1)
		    (not (pred_6 ?v2)))))

; problem
(define (problem ferry-l6-c3)
(:domain ferry)
(:objects obj_01 obj_05 obj_04 obj_06 obj_02 obj_07 
          obj_03 obj_09 obj_08 
)
(:init
(pred_4 obj_01)
(pred_4 obj_05)
(pred_4 obj_04)
(pred_4 obj_06)
(pred_4 obj_02)
(pred_4 obj_07)
(pred_2 obj_03)
(pred_2 obj_09)
(pred_2 obj_08)
(not-eq obj_01 obj_05)
(not-eq obj_05 obj_01)
(not-eq obj_01 obj_04)
(not-eq obj_04 obj_01)
(not-eq obj_01 obj_06)
(not-eq obj_06 obj_01)
(not-eq obj_01 obj_02)
(not-eq obj_02 obj_01)
(not-eq obj_01 obj_07)
(not-eq obj_07 obj_01)
(not-eq obj_05 obj_04)
(not-eq obj_04 obj_05)
(not-eq obj_05 obj_06)
(not-eq obj_06 obj_05)
(not-eq obj_05 obj_02)
(not-eq obj_02 obj_05)
(not-eq obj_05 obj_07)
(not-eq obj_07 obj_05)
(not-eq obj_04 obj_06)
(not-eq obj_06 obj_04)
(not-eq obj_04 obj_02)
(not-eq obj_02 obj_04)
(not-eq obj_04 obj_07)
(not-eq obj_07 obj_04)
(not-eq obj_06 obj_02)
(not-eq obj_02 obj_06)
(not-eq obj_06 obj_07)
(not-eq obj_07 obj_06)
(not-eq obj_02 obj_07)
(not-eq obj_07 obj_02)
(pred_1)
(pred_5 obj_03 obj_04)
(pred_5 obj_09 obj_04)
(pred_5 obj_08 obj_05)
(pred_3 obj_01)
)
(:goal
(and
(pred_5 obj_03 obj_02)
(pred_5 obj_09 obj_04)
(pred_5 obj_08 obj_04)
)
)

(:constraints
  (and
    (sometime-before  (pred_5 obj_03 obj_02) (pred_3 obj_05))
    (sometime-before  (pred_5 obj_08 obj_04) (pred_3 obj_06))
  )
)
)

; plan
1. (op_2 obj_01 obj_04)
   deleted: (pred_3 obj_01)
   added: (pred_3 obj_04)
   goals met: 1 of 3
2. (op_1 obj_03 obj_04)
   deleted: (pred_5 obj_03 obj_04) (pred_1)
   added: (pred_6 obj_03)
   goals met: 1 of 3
3. (op_2 obj_04 obj_06)
   deleted: (pred_3 obj_04)
   added: (pred_3 obj_06)
   goals met: 1 of 3
4. (op_3 obj_03 obj_06)
   deleted: (pred_6 obj_03)
   added: (pred_5 obj_03 obj_06) (pred_1)
   goals met: 1 of 3
5. (op_2 obj_06 obj_05)
   deleted: (pred_3 obj_06)
   added: (pred_3 obj_05)
   goals met: 1 of 3
6. (op_1 obj_08 obj_05)
   deleted: (pred_5 obj_08 obj_05) (pred_1)
   added: (pred_6 obj_08)
   goals met: 1 of 3
7. (op_2 obj_05 obj_04)
   deleted: (pred_3 obj_05)
   added: (pred_3 obj_04)
   goals met: 1 of 3
8. (op_3 obj_08 obj_04)
   deleted: (pred_6 obj_08)
   added: (pred_5 obj_08 obj_04) (pred_1)
   goals met: 2 of 3
9. (op_2 obj_04 obj_06)
   deleted: (pred_3 obj_04)
   added: (pred_3 obj_06)
   goals met: 2 of 3
10. (op_1 obj_03 obj_06)
   deleted: (pred_5 obj_03 obj_06) (pred_1)
   added: (pred_6 obj_03)
   goals met: 2 of 3
11. (op_2 obj_06 obj_02)
   deleted: (pred_3 obj_06)
   added: (pred_3 obj_02)
   goals met: 2 of 3
12. (op_3 obj_03 obj_02)
   deleted: (pred_6 obj_03)
   added: (pred_5 obj_03 obj_02) (pred_1)
   goals met: 3 of 3
